garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1717.PIC
        <edc:AdjustPoint edc:offset="3" edc:_addr="0x39A"/>
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEP" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEP" edc:nzwidth="8" edc:por="----0---" edc:_addr="0x39D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IOCEP3" edc:desc="" edc:mask="0x1" edc:name="IOCEP3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEN" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEN" edc:nzwidth="8" edc:por="----0---" edc:_addr="0x39E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IOCEN3" edc:desc="" edc:mask="0x1" edc:name="IOCEN3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEF" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEF" edc:nzwidth="8" edc:por="----0---" edc:_addr="0x39F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IOCEF3" edc:desc="" edc:mask="0x1" edc:name="IOCEF3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="8" edc:beginaddr="0x400" edc:endaddr="0x420" edc:regionid="sfr8">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x400"/>
        <edc:AdjustPoint edc:offset="9" edc:_addr="0x40C"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR4" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR4" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02401_tmr_Timer2_PIC16.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x415">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR4" edc:desc="" edc:mask="0xff" edc:name="TMR4" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PR4" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02401_tmr_Timer2_PIC16.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x416">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR4" edc:desc="" edc:mask="0xff" edc:name="PR4" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T4CON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T4CON" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-02401_tmr_Timer2_PIC16.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x417">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T4CKPS" edc:desc="" edc:mask="0x3" edc:name="T4CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR4ON" edc:desc="" edc:mask="0x1" edc:name="TMR4ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS" edc:desc="" edc:mask="0xf" edc:name="T4OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4CKPS0" edc:desc="" edc:mask="0x1" edc:name="T4CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKPS1" edc:desc="" edc:mask="0x1" edc:name="T4CKPS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4" edc:_addr="0x418"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR6" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR6" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02401_tmr_Timer2_PIC16.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x41C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR6" edc:desc="" edc:mask="0xff" edc:name="TMR6" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PR6" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02401_tmr_Timer2_PIC16.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x41D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR6" edc:desc="" edc:mask="0xff" edc:name="PR6" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T6CON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T6CON" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-02401_tmr_Timer2_PIC16.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x41E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T6CKPS" edc:desc="" edc:mask="0x3" edc:name="T6CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR6ON" edc:desc="" edc:mask="0x1" edc:name="TMR6ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS" edc:desc="" edc:mask="0xf" edc:name="T6OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T6CKPS0" edc:desc="" edc:mask="0x1" edc:name="T6CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6CKPS1" edc:desc="" edc:mask="0x1" edc:name="T6CKPS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="9" edc:beginaddr="0x480" edc:endaddr="0x4A0" edc:regionid="sfr9">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x480"/>
        <edc:AdjustPoint edc:offset="12" edc:_addr="0x48C"/>
        <edc:JoinedSFRDef edc:cname="NCO1ACC" edc:desc="" edc:name="NCO1ACC" edc:nzwidth="0x18" edc:_modsrc="DOS-01444B_NCO_v1_a.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x498">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO1ACCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO1ACCL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01444B_NCO_v1_a.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x498">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO1ACC0" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC1" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC2" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC3" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC4" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC5" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC6" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC7" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NCO1ACC" edc:desc="" edc:mask="0xff" edc:name="NCO1ACC" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO1ACCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO1ACCH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01444B_NCO_v1_a.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x499">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO1ACC8" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC9" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC10" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC11" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC12" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC13" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC14" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC15" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NCO1ACC" edc:desc="" edc:mask="0xff" edc:name="NCO1ACC" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="NCO1ACCU" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="NCO1ACCU" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01444B_NCO_v1_a.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x49A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO1ACC16" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC17" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC18" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC19" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC19" edc:nzwidth="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NCO1ACC" edc:desc="" edc:mask="0xf" edc:name="NCO1ACC" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="NCO1INC" edc:desc="" edc:name="NCO1INC" edc:nzwidth="0x18" edc:_modsrc="DOS-01444B_NCO_v1_a.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x49B">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO1INCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000001" edc:name="NCO1INCL" edc:nzwidth="8" edc:por="00000001" edc:_modsrc="DOS-01444B_NCO_v1_a.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x49B">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO1INC0" edc:desc="" edc:mask="0x1" edc:name="NCO1INC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC1" edc:desc="" edc:mask="0x1" edc:name="NCO1INC1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC2" edc:desc="" edc:mask="0x1" edc:name="NCO1INC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC3" edc:desc="" edc:mask="0x1" edc:name="NCO1INC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC4" edc:desc="" edc:mask="0x1" edc:name="NCO1INC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC5" edc:desc="" edc:mask="0x1" edc:name="NCO1INC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC6" edc:desc="" edc:mask="0x1" edc:name="NCO1INC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC7" edc:desc="" edc:mask="0x1" edc:name="NCO1INC7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NCO1INC" edc:desc="" edc:mask="0xff" edc:name="NCO1INC" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO1INCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO1INCH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01444B_NCO_v1_a.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x49C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO1INC8" edc:desc="" edc:mask="0x1" edc:name="NCO1INC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC9" edc:desc="" edc:mask="0x1" edc:name="NCO1INC9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC10" edc:desc="" edc:mask="0x1" edc:name="NCO1INC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC11" edc:desc="" edc:mask="0x1" edc:name="NCO1INC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC12" edc:desc="" edc:mask="0x1" edc:name="NCO1INC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC13" edc:desc="" edc:mask="0x1" edc:name="NCO1INC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC14" edc:desc="" edc:mask="0x1" edc:name="NCO1INC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC15" edc:desc="" edc:mask="0x1" edc:name="NCO1INC15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NCO1INC" edc:desc="" edc:mask="0xff" edc:name="NCO1INC" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="NCO1INCU" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="NCO1INCU" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01444B_NCO_v1_a.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x49D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO1INC16" edc:desc="" edc:mask="0x1" edc:name="NCO1INC16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC17" edc:desc="" edc:mask="0x1" edc:name="NCO1INC17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC18" edc:desc="" edc:mask="0x1" edc:name="NCO1INC18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC19" edc:desc="" edc:mask="0x1" edc:name="NCO1INC19" edc:nzwidth="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NCO1INC" edc:desc="" edc:mask="0xf" edc:name="NCO1INC" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rn---n" edc:cname="NCO1CON" edc:desc="Configurable logic cell control" edc:impl="0xb1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00---0" edc:name="NCO1CON" edc:nzwidth="8" edc:por="0-00---0" edc:_modsrc="DOS-01444B_NCO_v1_a.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x49E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="N1PFM" edc:desc="" edc:mask="0x1" edc:name="N1PFM" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="N1POL" edc:desc="" edc:mask="0x1" edc:name="N1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="N1OUT" edc:desc="" edc:mask="0x1" edc:name="N1OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="N1EN" edc:desc="" edc:mask="0x1" edc:name="N1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn---nn" edc:cname="NCO1CLK" edc:desc="" edc:impl="0xe3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000---00" edc:name="NCO1CLK" edc:nzwidth="8" edc:por="000---00" edc:_modsrc="DOS-01444B_NCO_v1_a.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x49F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="N1CKS0" edc:desc="" edc:mask="0x1" edc:name="N1CKS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="N1CKS1" edc:desc="" edc:mask="0x1" edc:name="N1CKS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="N1PWS0" edc:desc="" edc:mask="0x1" edc:name="N1PWS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="N1PWS1" edc:desc="" edc:mask="0x1" edc:name="N1PWS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="N1PWS2" edc:desc="" edc:mask="0x1" edc:name="N1PWS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="N1CKS" edc:desc="" edc:mask="0x3" edc:name="N1CKS" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="N1PWS" edc:desc="" edc:mask="0x7" edc:name="N1PWS" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="10" edc:beginaddr="0x500" edc:endaddr="0x520" edc:regionid="sfr10">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x500"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x50C"/>
        <edc:SFRDef edc:access="nn-n--nn" edc:cname="OPA1CON" edc:desc="" edc:impl="0xd3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-0--00" edc:name="OPA1CON" edc:nzwidth="8" edc:por="00-0--00" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1" edc:_addr="0x511">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OPA1CH" edc:desc="" edc:mask="0x3" edc:name="OPA1CH" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="OPA1UG" edc:desc="" edc:mask="0x1" edc:name="OPA1UG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA1SP" edc:desc="" edc:mask="0x1" edc:name="OPA1SP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA1EN" edc:desc="" edc:mask="0x1" edc:name="OPA1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA1CH0" edc:desc="" edc:mask="0x1" edc:name="OPA1CH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA1CH1" edc:desc="" edc:mask="0x1" edc:name="OPA1CH1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1PCH" edc:mask="0x3" edc:name="OPA1PCH" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1PCH0" edc:desc="" edc:mask="0x1" edc:name="OPA1PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA1PCH1" edc:desc="" edc:mask="0x1" edc:name="OPA1PCH1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
