garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1717.PIC
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CLC3CON" edc:desc="Configurable logic cell control" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CLC3CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF24">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3MODE" edc:desc="" edc:mask="0x7" edc:name="LC3MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="LC3INTN" edc:desc="" edc:mask="0x1" edc:name="LC3INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3INTP" edc:desc="" edc:mask="0x1" edc:name="LC3INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3OUT" edc:desc="" edc:mask="0x1" edc:name="LC3OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LC3EN" edc:desc="" edc:mask="0x1" edc:name="LC3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC3MODE0" edc:desc="" edc:mask="0x1" edc:name="LC3MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3MODE1" edc:desc="" edc:mask="0x1" edc:name="LC3MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3MODE2" edc:desc="" edc:mask="0x1" edc:name="LC3MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---nnnn" edc:cname="CLC3POL" edc:desc="Polarity control" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---uuuu" edc:name="CLC3POL" edc:nzwidth="8" edc:por="0---xxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF25">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3G1POL" edc:desc="" edc:mask="0x1" edc:name="LC3G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2POL" edc:desc="" edc:mask="0x1" edc:name="LC3G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3POL" edc:desc="" edc:mask="0x1" edc:name="LC3G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4POL" edc:desc="" edc:mask="0x1" edc:name="LC3G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LC3POL" edc:desc="" edc:mask="0x1" edc:name="LC3POL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1POL" edc:desc="" edc:mask="0x1" edc:name="G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2POL" edc:desc="" edc:mask="0x1" edc:name="G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3POL" edc:desc="" edc:mask="0x1" edc:name="G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4POL" edc:desc="" edc:mask="0x1" edc:name="G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLC3SEL0" edc:desc="Input select register 1" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLC3SEL0" edc:nzwidth="8" edc:por="---xxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF26">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC3D1S0" edc:desc="" edc:mask="0x1" edc:name="LC3D1S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D1S1" edc:desc="" edc:mask="0x1" edc:name="LC3D1S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D1S2" edc:desc="" edc:mask="0x1" edc:name="LC3D1S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D1S3" edc:desc="" edc:mask="0x1" edc:name="LC3D1S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D1S4" edc:desc="" edc:mask="0x1" edc:name="LC3D1S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3D1S" edc:desc="" edc:mask="0x1f" edc:name="LC3D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D1S" edc:desc="" edc:mask="0x1f" edc:name="D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D1S0" edc:desc="" edc:mask="0x1" edc:name="D1S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S1" edc:desc="" edc:mask="0x1" edc:name="D1S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S2" edc:desc="" edc:mask="0x1" edc:name="D1S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S3" edc:desc="" edc:mask="0x1" edc:name="D1S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S4" edc:desc="" edc:mask="0x1" edc:name="D1S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLC3SEL1" edc:desc="Input select register 1" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLC3SEL1" edc:nzwidth="8" edc:por="---xxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF27">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC3D2S0" edc:desc="" edc:mask="0x1" edc:name="LC3D2S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D2S1" edc:desc="" edc:mask="0x1" edc:name="LC3D2S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D2S2" edc:desc="" edc:mask="0x1" edc:name="LC3D2S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D2S3" edc:desc="" edc:mask="0x1" edc:name="LC3D2S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D2S4" edc:desc="" edc:mask="0x1" edc:name="LC3D2S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3D2S" edc:desc="" edc:mask="0x1f" edc:name="LC3D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D2S" edc:desc="" edc:mask="0x1f" edc:name="D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D2S0" edc:desc="" edc:mask="0x1" edc:name="D2S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S1" edc:desc="" edc:mask="0x1" edc:name="D2S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S2" edc:desc="" edc:mask="0x1" edc:name="D2S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S3" edc:desc="" edc:mask="0x1" edc:name="D2S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S4" edc:desc="" edc:mask="0x1" edc:name="D2S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLC3SEL2" edc:desc="Input select register 2" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLC3SEL2" edc:nzwidth="8" edc:por="---xxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF28">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC3D3S0" edc:desc="" edc:mask="0x1" edc:name="LC3D3S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D3S1" edc:desc="" edc:mask="0x1" edc:name="LC3D3S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D3S2" edc:desc="" edc:mask="0x1" edc:name="LC3D3S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D3S3" edc:desc="" edc:mask="0x1" edc:name="LC3D3S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D3S4" edc:desc="" edc:mask="0x1" edc:name="LC3D3S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3D3S" edc:desc="" edc:mask="0x1f" edc:name="LC3D3S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D3S" edc:desc="" edc:mask="0x1f" edc:name="D3S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D3S0" edc:desc="" edc:mask="0x1" edc:name="D3S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S1" edc:desc="" edc:mask="0x1" edc:name="D3S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S2" edc:desc="" edc:mask="0x1" edc:name="D3S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S3" edc:desc="" edc:mask="0x1" edc:name="D3S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S4" edc:desc="" edc:mask="0x1" edc:name="D3S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLC3SEL3" edc:desc="Input select register 3" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLC3SEL3" edc:nzwidth="8" edc:por="---xxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF29">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC3D4S0" edc:desc="" edc:mask="0x1" edc:name="LC3D4S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D4S1" edc:desc="" edc:mask="0x1" edc:name="LC3D4S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D4S2" edc:desc="" edc:mask="0x1" edc:name="LC3D4S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D4S3" edc:desc="" edc:mask="0x1" edc:name="LC3D4S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D4S4" edc:desc="" edc:mask="0x1" edc:name="LC3D4S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3D4S" edc:desc="" edc:mask="0x1f" edc:name="LC3D4S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D4S" edc:desc="" edc:mask="0x1f" edc:name="D4S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D4S0" edc:desc="" edc:mask="0x1" edc:name="D4S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4S1" edc:desc="" edc:mask="0x1" edc:name="D4S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4S2" edc:desc="" edc:mask="0x1" edc:name="D4S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4S3" edc:desc="" edc:mask="0x1" edc:name="D4S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4S4" edc:desc="" edc:mask="0x1" edc:name="D4S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC3GLS0" edc:desc="Gate logic select register 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC3GLS0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF2A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3G1D1N" edc:desc="" edc:mask="0x1" edc:name="LC3G1D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G1D1T" edc:desc="" edc:mask="0x1" edc:name="LC3G1D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G1D2N" edc:desc="" edc:mask="0x1" edc:name="LC3G1D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G1D2T" edc:desc="" edc:mask="0x1" edc:name="LC3G1D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G1D3N" edc:desc="" edc:mask="0x1" edc:name="LC3G1D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G1D3T" edc:desc="" edc:mask="0x1" edc:name="LC3G1D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G1D4N" edc:desc="" edc:mask="0x1" edc:name="LC3G1D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G1D4T" edc:desc="" edc:mask="0x1" edc:name="LC3G1D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="D1N" edc:desc="" edc:mask="0x1" edc:name="D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1T" edc:desc="" edc:mask="0x1" edc:name="D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2N" edc:desc="" edc:mask="0x1" edc:name="D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2T" edc:desc="" edc:mask="0x1" edc:name="D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3N" edc:desc="" edc:mask="0x1" edc:name="D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3T" edc:desc="" edc:mask="0x1" edc:name="D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4N" edc:desc="" edc:mask="0x1" edc:name="D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4T" edc:desc="" edc:mask="0x1" edc:name="D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC3GLS1" edc:desc="Gate logic select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC3GLS1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF2B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3G2D1N" edc:desc="" edc:mask="0x1" edc:name="LC3G2D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2D1T" edc:desc="" edc:mask="0x1" edc:name="LC3G2D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2D2N" edc:desc="" edc:mask="0x1" edc:name="LC3G2D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2D2T" edc:desc="" edc:mask="0x1" edc:name="LC3G2D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2D3N" edc:desc="" edc:mask="0x1" edc:name="LC3G2D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2D3T" edc:desc="" edc:mask="0x1" edc:name="LC3G2D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2D4N" edc:desc="" edc:mask="0x1" edc:name="LC3G2D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2D4T" edc:desc="" edc:mask="0x1" edc:name="LC3G2D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="D1N" edc:desc="" edc:mask="0x1" edc:name="D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1T" edc:desc="" edc:mask="0x1" edc:name="D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2N" edc:desc="" edc:mask="0x1" edc:name="D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2T" edc:desc="" edc:mask="0x1" edc:name="D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3N" edc:desc="" edc:mask="0x1" edc:name="D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3T" edc:desc="" edc:mask="0x1" edc:name="D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4N" edc:desc="" edc:mask="0x1" edc:name="D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4T" edc:desc="" edc:mask="0x1" edc:name="D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC3GLS2" edc:desc="Gate logic select register 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC3GLS2" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF2C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3G3D1N" edc:desc="" edc:mask="0x1" edc:name="LC3G3D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3D1T" edc:desc="" edc:mask="0x1" edc:name="LC3G3D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3D2N" edc:desc="" edc:mask="0x1" edc:name="LC3G3D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3D2T" edc:desc="" edc:mask="0x1" edc:name="LC3G3D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3D3N" edc:desc="" edc:mask="0x1" edc:name="LC3G3D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3D3T" edc:desc="" edc:mask="0x1" edc:name="LC3G3D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3D4N" edc:desc="" edc:mask="0x1" edc:name="LC3G3D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3D4T" edc:desc="" edc:mask="0x1" edc:name="LC3G3D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="D1N" edc:desc="" edc:mask="0x1" edc:name="D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1T" edc:desc="" edc:mask="0x1" edc:name="D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2N" edc:desc="" edc:mask="0x1" edc:name="D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2T" edc:desc="" edc:mask="0x1" edc:name="D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3N" edc:desc="" edc:mask="0x1" edc:name="D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3T" edc:desc="" edc:mask="0x1" edc:name="D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4N" edc:desc="" edc:mask="0x1" edc:name="D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4T" edc:desc="" edc:mask="0x1" edc:name="D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
